README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>PyTagger: A python part of speech tagger.</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-10-11 Mon"/>
<meta name="author" content="Alex Henning"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">PyTagger: A python part of speech tagger.</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">About </h2>
<div class="outline-text-2" id="text-1">

<p>This is a parts of speech tagger. It tags the part of speech for all words in sentence. It uses <a href="http://en.wikipedia.org/wiki/Brill_tagger">Brill's Tagging method</a> based of <a href="http://code.google.com/p/jspos/">jspos</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Parts of speech </h2>
<div class="outline-text-2" id="text-2">

<dl>
<dt><code>CC</code></dt><dd>
Coord Conjuncn: and,but,or
</dd>
<dt><code>CD</code></dt><dd>
Cardinal number: one,two
</dd>
<dt><code>DT</code></dt><dd>
Determiner: the,some
</dd>
<dt><code>EX</code></dt><dd>
Existential there: there
</dd>
<dt><code>FW</code></dt><dd>
Foreign Word: mon dieu
</dd>
<dt><code>IN</code></dt><dd>
Preposition: of,in,by
</dd>
<dt><code>JJ</code></dt><dd>
Adjective: big
</dd>
<dt><code>JJR</code></dt><dd>
Adj., comparative: bigger
</dd>
<dt><code>JJS</code></dt><dd>
Adj., superlative: biggest
</dd>
<dt><code>LS</code></dt><dd>
List item marker: 1,One
</dd>
<dt><code>MD</code></dt><dd>
Modal: can,should
</dd>
<dt><code>NN</code></dt><dd>
Noun, sing. or mass: dog
</dd>
<dt><code>NNP</code></dt><dd>
Proper noun, sing: Edinburgh
</dd>
<dt><code>NNPS</code></dt><dd>
Proper noun, plural: Smiths
</dd>
<dt><code>NNS</code></dt><dd>
Noun, plural: dogs
</dd>
<dt><code>POS</code></dt><dd>
Possessive ending: 's
</dd>
<dt><code>PDT</code></dt><dd>
Predeterminer: all, both
</dd>
<dt><code>PP$</code></dt><dd>
Possessive pronoun: my,one's
</dd>
<dt><code>PRP</code></dt><dd>
Personal pronoun: I,you,she
</dd>
<dt><code>RB</code></dt><dd>
Adverb: quickly
</dd>
<dt><code>RBR</code></dt><dd>
Adverb, comparative: faster
</dd>
<dt><code>RBS</code></dt><dd>
Adverb, superlative: fastest
</dd>
<dt><code>RP</code></dt><dd>
Particle: up,off
</dd>
<dt><code>SYM</code></dt><dd>
Symbol: <code>+,%,&amp;</code>
</dd>
<dt><code>TO</code></dt><dd>
to: to
</dd>
<dt><code>UH</code></dt><dd>
Interjection: oh, oops
</dd>
<dt><code>VB</code></dt><dd>
verb, base form: eat
</dd>
<dt><code>VBD</code></dt><dd>
verb, past tense: ate
</dd>
<dt><code>VBG</code></dt><dd>
verb, gerund: eating
</dd>
<dt><code>VBN</code></dt><dd>
verb, past part: eaten
</dd>
<dt><code>VBP</code></dt><dd>
Verb, present: eat
</dd>
<dt><code>VBZ</code></dt><dd>
Verb, present: eats
</dd>
<dt><code>WDT</code></dt><dd>
Wh-determiner: which,that
</dd>
<dt><code>WP</code></dt><dd>
Wh pronoun: who,what
</dd>
<dt><code>WP$</code></dt><dd>
Possessive-Wh: whose
</dd>
<dt><code>WRB</code></dt><dd>
Wh-adverb: how,where
</dd>
<dt>,</dt><dd>
Comma: ,
</dd>
<dt><code>.</code></dt><dd>
Sent-final punct: <code>. ! ?</code>
</dd>
<dt><code>:</code></dt><dd>
Mid-sent punct: <code>: ;</code>
</dd>
<dt><code>$</code></dt><dd>
Dollar sign: <code>$</code>
</dd>
<dt><code>#</code></dt><dd>
Pound sign: <code>#</code>
</dd>
<dt>"</dt><dd>
quote:  "
</dd>
<dt><code>(</code></dt><dd>
Left paren: <code>(</code>
</dd>
<dt><code>)</code></dt><dd>
Right paren:  <code>)</code>

</dd>
</dl>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Examples </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1">Madlibs </h3>
<div class="outline-text-3" id="text-3_1">


</div>

<div id="outline-container-3_1_1" class="outline-4">
<h4 id="sec-3_1_1">About </h4>
<div class="outline-text-4" id="text-3_1_1">

<p>This is an implementations of madlibs that takes any text and makes it runnable as a madlibs game using pytagger.
</p></div>

</div>

<div id="outline-container-3_1_2" class="outline-4">
<h4 id="sec-3_1_2">Examples </h4>
<div class="outline-text-4" id="text-3_1_2">

<pre class="example">
$ python madlib.py

Please give me a plural noun. Cats
Please give me a noun. EMACS
Please give me an adverb. tastily
Please give me a verb. think

Cats are often surprised , somtimes astounded at the EMACS he
excersized . He could run , walk , sleep and tastily think !
</pre>


<pre class="example">
$ python madlib.py

Please give me a proper noun. EMACS
Please give me a noun. athena
Please give me an adverb. incompetently
Please give me a prepostition. beneath
Please give me a noun. someone
Please give me an adjective. purple
Please give me a plural noun. gods
Please give me an adjective. stupid
Please give me a prepostition. on top of
Please give me a noun. Cylons

The Cylon EMACS is long over athena yet we must not forget the
reasons why incompetently many sacrificed so much in the cause
beneath freedom . The cost of wearing the someone can be purple
.. . [after looking at crowd] but sometimes gods too high.

You know , when we fought the Cylons , we did it to save
ourselves from extinction . But we never answered the question
, why ? Why are we as a people stupid saving ? We still commit
murder because of greed , spite , jealousy . And we still visit
all of our sins upon our children . We refuse to accept the
responsibility for anything on top of we've done . Like we did
with the Cylons . We decided to play God , create life . When
that life turned against us , we comforted ourselves in the
knowledge that it really wasn't our fault , not really . You
cannot play God then Cylons your hands of the things that
you've created . Sooner or later , the day comes when you can't
hide from the things that you've done anymore .
</pre>

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Alex Henning
</p>
<p class="date"> Date: 2010-10-11 Mon</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 23</p>
</div>
</div>
</body>
</html>
